Repository: K227-arch/Rasberry-model
Catalog: runyoro_nmt/data/tm/runyoro_en.tmx
Source language: nyk
Languages: en

source: abakazi ba/ima bari; ente zijuga ziti; ngambire nti; embuzi ekatigira ha kwambuka ekisam·u; amaizi g'ekisaaru nugo gaagitigize
en: Women dig like this (show action); Cows mow like this (make the sound), ndo/10 mi, Iam like this; Ihave said thus (quote what you have said) agamb1re ati, he has said thus (quote his words). Ti- negative prefix at the beginning of a verb stem beginning with a consonant and the vowel i. Tibaijuka, they do not remember; The goat became stubborn when it came to crossing the river; It was fear of the river waters that made it stubborn

source: tiganda
en: Gather and carry wood for beginning to bujld

source: munywani we nuwe yamut1gandisize enju ye egi
en: It is his blood brother who helped him gather and carry wood for beginning to build his house

source: tigika
en: To support (a falling thing) with poles

source: akamweta kwnutigikira enju ye
en: He tigita timbura called him to support his house with poles (it was almost falling)

source: tigita
en: To tickle

source: tilhiika
en: To cram, stuff, over load

source: ebyokulya ebyamurwaize akabimutiihiikira owaabu
en: The food that made him/her sick, she stuffed to him/her while at her home

source: tiika
en: To dote on, be infatuated with

source: omuntu obu aba aguzire orugoye ruhyaka anttiika
en: When a person buys a new cloth he/she gets infatuated with it

source: tiikuruka
en: To grow tired of

source: tiima
en: Chop small, mince

source: enyama y 'omwihuki w 'amaino baakugitiimirege; haroho obwoma abantu obu batiimisa enyama
en: The meat for thetoothless person would be minced; There are machines which are. Used to mince meat

source: tilna
en: To fear, hold in reverence

source: tilniirra
en: To leave in the lurch

source: omusaija akatiiniriirra mugenzi we omwirungu obu bagiire kuhiiga embogo
en: A man left his hunting mate in the lurch when he was caught by the buffalo in the jungle

source: tiitilra
en: To cheep, twitter

source: akaana k 'enkoko katiitiirre omu mapapa ga nyinako; engoye ze nizeera tiitiiti; ebirika bifuka tiitiiti
en: A chick twitters in it's mothers wings; His/ her clothes are copiously white; Snow is absolutely cold

source: tiiza
en: {pf. -tiirize)

source: timba
en: Scoop, to dig with stick, decorate with flowers and coloured cloth

source: ebitakuli bito babitimba kandi ebikuru babiteera n 'efuka
en: People scoop up young potatoes with a stick and the fully grown up with a hoe

source: timbun
en: To beat entimbo

source: tinda
en: To be discoloured (cloth) due to poor tiritn """"t

source: engoye obu ozoogya otaimaziremu shake about; t. ekitabu
en: Waddle. Burofu zitinda, clothes which have not tintimya, ku-, oku-, v.c; Had become stale

source: tindikuurra
en: Rr

source: tindura
en: Utter all secrets when gambolling more than that. Quarrelling

source: to nibaririiha kukira aho; ebintu byakyo byona
en: Ifhis/her children take up(mats), take down (bedstead), to bad a large compound they would be mess up things; When a person kakuba ebyokulya obicumbisa omuurro loses something in his/her bed, he/she ogutarukumara, nibitirima. If you cook removes each and every item on it so food under insuffient fire, it becomes as to find it

source: tirimbira
en: To skip about, frolic gambol, caper

source: okutirimbira na kwo k 'okuroorraaho to make to remove thfogs for cleaning kook1Jsemererwa kw 'abaana
en: House

source: titima
en: To be hard and black in center (plantains)

source: orubaa/e ob11 ruteera ebitooke ebyanire rubititimya
en: When hailstone hits newly produced plantains it makes them hard and black at their center

source: titira
en: To shake with cold, shiver

source: atiina kugenda omukibira nyenkya kara kutitiirraamu; aban/11 bakira muno kutobeerra omubisaaru ebirumu ama/ehe
en: He/she fears to go to the forest very early in the morning as he/she will shiver with coldness; People often sink when going through mires (swampy grounds)with deep holes

source: tobeza
en: To put millet Hour into boiling water when starting to stir (cook) millet (oburo)

source: obu yasangireamazire irakutobeza enyungu yamuleka yahotoorra kimu
en: When she· found that she had already put millet in the boiling water, she let her continue with the cooking

source: toboka
en: , speak irrationally, talk randomly

source: toga
en: To claw

source: kutoga kugenzire nikukeeha omumasomero
en: Teasing has been reduced in schools

source: togatoga
en: To walk about naked

source: togolekwa
en: To speak incoberently

source: omuntu atogo/ekwa obu aba naabaza ebitarula11eerana hamu
en: A person is incoherent if he/she speaks illogically and inconsistently

source: togonyora
en: To crush, squash

source: togota
en: To bubble (when boiling)

source: ebyokulya ob11 baba nibabicumba bikatandika kutogota buli biri haihi kuhya
en: When food that is being cooked begins to bubble it means that it is nearly getting ready

source: toha
en: To grow thin and weak, look mournful

source: toibya
en: To be on heat (female dogs)

source: toija
en: Till

source: toka
en: To shout, benoisy

source: akatokera omukooti om11ramL1Zi yamufubira; rediyo obu agitokesa muno ebuza abarukubaza obusinge
en: He/sbe became noisy in court and the magistrate reprimanded him/her; When you put the radio volume very high it interferes with people's conversation

source: tokeerra
en: Pr. 2,, abagizansoni obu baba nibalya abantu tibabatokeerra, no noise should be made by other people when in-laws are eating. Toko, e-, n. Cl., loud talking, shouting, clamour

source: tokolekana
en: To make any loud, indistinct noise, brawl, shout, screech

source: amaa1wa gatokolekaniza abarukuganywa
en: Banana wine makes people who are drinking it speak loudly and indistinctly

source: tokoma
en: People's property is often p fire or in the sea

source: tokomera
en: Of tokoma ( r tokomiire)

source: tokomeza
en: (p:. -tokomiizci: pass of c.form, tokomevbwa, ku-,ok,,.

source: tokomoka
en: To make noise that will disturb one, disappear from sight

source: tokoora
en: & v.tr

source: akatokoora
en: Omuntu ow 'embabazi yamutokoora, he got a foreign body into his eye and some kind person took it out from it

source: toma
en: To begin

source: Eryato likadikira abakaba bafirumu boona baatokomera omunyanja; ayayokeze enju ye nuwe yagondeze okutokomya ebintu bye; ebintu by'abantu bikira okutokomebwa omu11rro rundi enyanja
en: A boat capsized and all the people aboard it perished in the sea; He/she that burnt bis/ her house was the one who wanted to have his property destroyed; Eating of millet meal so that others can also eat

source: tomera
en: To charge into, knock against accidentally

source: akatomera ekisiika omumwirima naagya kubyama; akavuga motoka ye atamiire yagitomeza ekisa ky 'oruguudo
en: He/she knocked against a wall in the dark when he/she was going to bed; He drove his car while he was drunk and he made it knock against a road bank

source: tona
en: To be spotted

source: abantu abamu batona amajugaabo n 'inoni; obu oba otaina rangi y' Ekijungu noosobora kutonesa inoni
en: Somepeople depict houses with chalk; If you do not have manufactured paint you can use locally mined white clay (chalk)

source: tonda
en: To identify, establish identity of,recognize

source: orusu; 1. obusegu; t. omutima; akeeta abanyaruganda kwija kumutondera omwana
en: Prepare the roof when beginning to build a round native hut; Of snake, get poison ready so that it can have it discharged; Of a child, grow up and reason as a grown up person; He invited clansmen to come and identify the child for him

source: tondera
en: To explain, tell all

source: abantu abandi tibeetaaga kubatondera ebikorwa by'abany abuzaale baabo ebibi
en: Some people do not need to have the bad deeds of their relatives told to them

source: tondogoorra
en: T1:

source: oburo obwasigaire omumusiri butagesirwe babllf ondogoroiremu bwona bwalrwamu; akanga kutondogoorra byona ebyarugiriif weho okunobangana kwabo; akaragira abaana be kugenda k11tondogoroorra nyinenkunt bo oburo abagesi obu baasigire omumusiri
en: They have picked all the millet that was left unreaped in the garden; He/she refused to explain fully the cause of their estrangement; He/she ordered his/her children to go and reap the remaining millet that the reapers left in the garden for their grandmother

source: tondooka
en: Split open (beans, peas), ebihimba obu byoma muno bitondooka, when beans get to dry they split

source: tondoora
en: To shell, peel, remove husks, split open, unpod

source: akabasaba kumutondoorra ebihimba bye
en: He/she asked them to unpod the beans for her

source: tondooza
en: To separate from, select, distinguish between

source: ibanja lye akalitongera omwaka gwo11a
en: He/she spent the whole year dunning him for payment of his/her debt

source: tongana
en: To go to law, lead against

source: omusango gw 'okwonesa akagutonganira omwaka gwona; akamutonganiza habw 'okumwoneseza; biro binu emisango etongamva abatonganirizi
en: He/she spent the whole year pleading against a charge that his animals ate the crops of a neighbour; He/she made him/ her plead against charges that his/her animals ate bis/her crops; These days it is the advocates that plead against charges put against someone

source: tonganiirra
en: To plead for another

source: akasinga omusango lwbwokuba akaba aina arukumutongoniirra; akamutonganiriirra omukooti enkuru; atonga11iriin1•e abato11ga11irizi basatu; Bakatutanga kuto11gyatongya ebintu bingi obu turaabaga nitusaba; ekizina kyabo kikaba kiri kinmgi f..yonka kikaburwa ow 'okukitongeerra kunmgi; bagamba bugamba ebigambo ha kintu; abazim abataina mutongerezi basaba omuntu w 'okubatongereerra; ekizina kitatongeriirwe tikyoleka kunmgi ekigendererwa kyakyo
en: He/she was able to win the case because he/she had someone pleading for him/her; He/she pleaded for him/her in I.he High court; Three advocates pleaded for him/her. Tongatongya, oku-, oku-, v.i; We were advised not to utter many words when praying. Tongeerra ku-, oku-, v.tr. & v.i; Their song was nice but it lacked a soloist· omukiikaro ky 'okuzina abantu aband; Instead of singing some other people only recite words about something; Singers who do not have a soloist will hire one to come and lead them in the singing; A song without a soloistdoes not reflect its aimclearly

source: tongora
en: To pick, select the best or ripest

source: ebihimba bye asangire babitongoiremu ebibaire byengere byona; Byakunaga akarwanisa Byenkya habw 'okutongora mukazi we; abaatongoire ebihimba bye bakabitongoorra omunjura eyasiibire neegwa
en: She found that all her ripe beans had been picked; Byakunaga fought Byenkya for dancing with his wife; Those who picked her ripest beans did so when it rained throughout the day

source: tonokora
en: To arouse pain in the sore as a result of bringing it into contact with a hard object accidentally

source: obu arubata ekihooya kye kitonokora; tonokya toooyeerra akatonokoorra omu111uhanda naagya omwirwarro
en: When he/she walks he/she arouses pain in his/her sore; He/she aroused pain in his/ her sore as he/she went to hospital

source: bakaba nibazaana owanyina yamutonokya ekihooya yatandika kurra; akamutonokeza omukizaaniro nibazaana; atonokiibwe mugenziwe obu babaire nibazaana
en: They were playing when accidentally his/her brother caused pain in his/her sore and consequently she cried; He/she caused pain in his/her sore while they played; It is his/her brother/sister that caused pain in his/her sore while they played

source: tonta
en: To grow thin and feeble, look mournfully

source: omwana onu akatontera kutaliisibwa kunmgi; kwikara nooteera omwana ogu nikwija kumutonsa
en: This child grew thin and feeble due to lack of proper feeding; Beating that child frequently will make him thin and feeble

source: tontera
en: Dive down, descend

source: tontoma
en: To murmur, be angry, growl

source: nkahuurra abantu abarukutontoma aheeru; 11/cagonza kumanya kiki ekikaba nikibatontomya
en: I heard people murmuring outside; Iwanted to know what made them to munnur

source: tontorrooma
en: To gmmble, murmur

source: abapagasa babaire 11ibatontorrooma habw 'esaaha barukumara hamulimo
en: The labourers have been grumblingabout the hours they are spending at work

source: tooka
en: To give present to (loved one)

source: iba akamutookera esaaha ya hamukono hakiro ky 'okuzaarwa kwe; omubusinge bwa ira ebintu ebyatookwaga byali bike muno
en: Her husband gave her a wrist watch on the anniversary of her birthday; In the past, there were very few things that used to be given out by people as presents to their lovers

source: tooliika
en: To collect and put together worn-out things, patch old clothes

source: toonya
en: To drizzle, drip

source: akaikaarra omukiikaro ekirukutonywamu amaizi gobwiriza; ekisisi ekinimu akah11r11 kitonyesa amaizi; amaizi nigasobora kuba nigatoonyesebwa akahuru akataigaliirwege
en: Gaamutoonyera, he/she sat in a place where water from the grass thatch roof was dripping and it dripped on him/ her; A caJabash which bas a hole in it makes the water in it drip; The water could be dripping from a hole that was left unblocked

source: toonyeerra
en: To drizzle. Toonyereza toorra

source: toonyereza
en: To dress up, be grand

source: akatonyererezahabugenyi bwa munywani we Birikumwoha
en: He/she dressedup grandly at the wedding of his friend Birikumwoha

source: toonyeza
en: To dot, mark or tick off

source: kakuba oikaarra hansi y 'orugoye n1bisi orohanikire nirukutoonyeza amalZI; abapagasa eki babatoonyereza nukwo kugonza kumanya ebiro ebi baakozire n 'ebi bataakozire; abaana abarukusoma omugigi abandi batonyezibwa buli kiro kya Sande
en: If you sit under a hanging wet cloth water from it will drip on you; The reason why labourers are marked off daily is to know the number of days they worked and those they did not; Some children who attend religious classes are marked on every Sunday

source: toonyoroka
en: To leave off (rain), get dry

source: anyakwigamire enjura obu aba naagenda hara tagidndiirra kutoonyoroka
en: One who hastaken shelter from rain and bas a longjoumey to cover will not wait till it ceases

source: toonyorrooka
en: To be empted of every drip

source: haroho engoye ezanguha kutoonyorrooka obu ziba zijubire n 'ezitanguha; orugoye onijubire rutoonyorrookera hamuguha rohanikire
en: There are clothes which take a short time to stop dripping of water when wet and those which take a long time; A wet cloth will stop dripping of water on a line where it's bung

source: toora
en: To be sharp

source: obuhya bwe butoize embogo; kinu ekipanga kitoozebwa muyamba
en: His pit has a buffalo fallen in it· pass of c.form, toozebwa, ku-, oku- (pi -tooziibwe); This big knife is sharpened by a file

source: Sande nayo etooza abantu baingi; abantu batoozibwa muno ekiro kyamazaarwa kukira ebiro ebindi
en: Sunday will also make many people dress grandly; Christmas will make people dress more grandly than they do on any other day

source: katoora ente nyowe nkatoora amasa
en: You have received a cow while l have received an empty band (said in a guessing game) "okatoora eha"

source: toorana
en: To be well mixed

source: toorra
en: To weed (bean, millet)

source: toorwa
en: To be lewd, lascivious

source: tooza
en: To cause to be sharp

source: torooga
en: To abort, have a miscarriage (esp.animals)

source: enimi obu etemba ente e/.:11/ize; eme ze niitoroogebwa ibura ly 'ekisura
en: Egitoroogya, when a buU serves a pregnant cow, it miscarriages; His cows get miscarriage due to salt deficiency I due to lack ofsalt

source: toroogereza
en: To defile, make sex with an immature girl, of a bull serve a calf which is not yet ready for mating

source: omwisiki anyakutoroogerezi ibwe obu atwara enda olmzaara kwe kutuntuza abazaire be
en: When an immature girl getspregnan t, her parents get worried about her delivery. Toroogo, e-, n. Cl.9

source: torotoro
en: Adv.,yemeerra t.,stand erect. Tota, ku-, oku-, v.i

source: totatota
en: To tuga

source: tosatosa
en: Pass of c.fonn, tosatosebwa, ku-, oku-

source: toteerra
en: To deteriorate, degenerate, slacken, lose strength

source: ensaano y 'oburo akagita omumai2i agagihinguraine
en: Oburo bwatoteerra, she put millet flour in excessive water and as a result it made a very soft dough

source: akaburwa ensaa110 y'okubutotoroza
en: She lacked additional millet flour to sprinkle onto the millet she was cooking so as to recover the dough that was getting too soft

source: totorrooka
en: To become stiff when more flour is added (of millet when being cooked)

source: Otwana tw 'embeba batwisire
en: They have killed the youngs of a rat. -tu-, t • person pl. Subj and obj. Prefix, we, us. Nitusoma, we are reading. Batugondeze, they have loved us. Tu-, o-, cl., prefix for nouns in cl. 13

source: tuga
en: To knead with the bands

source: obwenju bwa sukaali babut11gira omubuhunga bwa muhogo nukwo battmgemu ekibumbe ky 'olatcumbamu kabaragara
en: Sweet banana is kneaded together with cassava flour in order toget the dough omofwhich pancakes are made

source: tugika
en: To forcibly demand payment of debt

source: omutongi atugika omunyaibanja ou arukwerengeerra
en: A creditor forcibly demands payment from a debtor lie/she looks down upon

source: tuguUkwa
en: To liung around, stand for a long time doing nothing

source: abaana baahaburwaga kutatug11likwa hagati y 'abantu bakum; akatugulikinva omumaiso g 'abagenyi baamufubira
en: Obu baabaga baikaliire nibabaza, children were warned not to hung around where old people are seated and conversing; He/ she hung around before visitors and was consequentlypunished. Tuguoduka,ku -, oku-, v.i.,, toprotrude

source: tuguojuka
en: To be squashed

source: ebyenju akaba aba/eetiire bikatugunjukira omunsahu
en: The ripe banana he/she had brought them were squashed in the sack in which they were packed

source: tuguojura
en: H:

source: busaho muntu anyakugonza kutugunjuurra ekintu omungaro ze
en: No one likes squashing something in his/her hands

source: tugunya
en: To tread on, squash

source: akagwa hansi nibairuka bagenzi be baamutugunya
en: H el she fell down while running and his/ her playmates trode oo her

source: tuka
en: To defame, run down

source: embwa bakagitukira busa ngu ebwagwire obwana mukaaga kamu yaka/ya
en: People defamatorily ran down the bitch to say that it gave birth to six puppies and ate up one

source: tukiriza
en: To pester, importune

source: naatukura tuktt
en: He/she is extremely red

source: tukuma
en: To tremble, shiver

source: akatukumira kurora abasen1kale baizire muka ye; emundu niyo etukumya omuntu; akamara ebirobibirinaatukumira
en: He/ she trembled on seeing soliders at bis/her home; It is a gun that makes one tremble; Be/she shivered for two days

source: tukura
en: To be red

source: tulingika
en: T1:

source: akaba naatwana; bakamutulingikisa om11guha gw 'obugoigo
en: Bamuboha bam111ulingika, he/she was fighting and consequentely they tied him/her firmly; They tied him/ her firmly with a rope made of sisal

source: tuma
en: To send, send for

source: mukama w 'amaju akatumira abapangisa be omutabani bam11he sente ze ez 'obusuuru; omusuubuzi atwnisize egaali ikumi; ebihimba obu babita omumaizi bitumba; t. ebigambo
en: The land lord sent his son to bis/her tenants for the house rental; The trader ordered for ten bicycles; Beans when put in water will swell; Exaggerate matters

source: tumbika
en: To dip into (e.g. Food into salt} = cumya

source: obu haizire ibura ly 'emikubi abantu batwnbikaga ebitooke hakisura nmdi ha kaamurali enyakuseeriilwemu ekisura
en: When relish was in scarce(sauce), one would dip plantain into salt with ground pepper

source: tumbisa
en: Cause to rise

source: tumbuka
en: To swell into a lump, grow into a mature person

source: akagonza kumanya omubaana owanyina aba yasigire obu haraaba haru111u omwana atumbukireho
en: Be/she wanted to know, whether among his/her brother's orphans there was any child who was rather mature

source: tumbura
en: To exalt, speak well of

source: abasibensi kukora n 'amaani nikyo kitumbuza ekyaro /.y. abo
en: Hard working of the inhabitants brings progress in their village

source: tumburuka
en: To be very tall, rise to a great height

source: oburo obubaire nibusisa nk 'oburaasiriira hati butumburukire
en: The millet crop that appeared stunted is now flourishing

source: akamutumiririza kutagira mwana ondi ow'okutuma
en: He/she kept on sending him/her due to lack of another child to send

source: tumya
en: To send for from a distance

source: tuna
en: To gaze, tuna tungalllira stand motionless

source: tunama
en: To show through (e.g. Bones through flesh), protrude

source: amagufa gakamutunamira enaku
en: His/her bones protruded due to poverty. C. Form, tunamya, ku-, oku-

source: tunda
en: To sell

source: omutabani nuweyamutundiire embuzi ye; omusoro nugwo gwamutundize embuzi ye
en: It was his/her son who sold the goat on his/her behalf; It was due to graduated tax that he had to sell his goat

source: tundubara
en: To swell in water

source: omuntu atundubara obu aikaarra omubantu akatunuurra kwonka ataina kintu kyona eki arukubaza
en: A person is sluggish when he/shesits among people without making anycontribution

source: tundubika
en: To soften in water, soak

source: tunduka
en: To protrude, stick out

source: tundura
en: To cause to protrude, squeeze out· pass. Form, tundurwa, ku-, oku-

source: tuoga
en: Rr

source: abantu kwonka abairu baabatungiraga omubulemu; mukama we akamutungisa; akamusaba kumutimgira enkwanzi ze; aikaire naatungisa mugenziwe enkwanzi ze
en: Ordinary people would acquire slaves during the war; His master made him rich; She asked her to thread her beads; She has been helping her sister to thread her beads

source: tuogama
en: To be very steep

source: akatungamya omutwe gw 'ekifaalisi hakitabu n 'ekisago
en: He/she raised the head of the mattress on the bed with a pillow. Tungama,ku-, oku -, v.tr

source: tungamira
en: To get on top of (a person)

source: tungeera tunika akamusanga amutungamiire naamuniga yamuteera 11'omwigo; ente etungamiirwe entale ogijunira entale etakainamire kugiruma
en: He found him on bis top chocking him and for that reason he beat him with a stick; If you are to save the life of a cow that has been attacked by a lion one has to do so before it bows down to bite it

source: tungeera
en: To collect, clog, stand, stagnant (water)

source: tikiri kirungi amaizi kutungeerra haihi n 'eka; ezigati eteeculikire etungeeza amaizi
en: It is not good for water to clog near a home; A compound without a slope will cause water to collect in it

source: tungikiirra
en: To put on the top of

source: abaleesi b'amaizi ira baayetwekaga ensoha bazitungukiirraho ekintu ki11di
en: Water carriers long ago used to carry water-jars and then put something else on their tops

source: tungira
en: {pf. -tungiire)

source: ebyokulya ebirukucumbwa obu obona byatungira; munywani we nuweyamuhmgiire omulimo
en: Buli byaijakuhya, when you see food that is cooking steaming that means it is about to be ready; It is his friend that got her ajob

source: tungirwa
en: P ass., =fo reg

source: tunguka
en: To grow tall

source: tungununa
en: To taste sour

source: tungura
en: To fasten pointed narrow part of hoe firmly to handle

source: abasaija baat1mguruurra bakazi baabo enfuka
en: Men fastened hoes firmly to handles for their wives

source: tungurruuka
en: To come, unstring or unthreaded, come off a rope or stick

source: tunguurra
en: To begin to form (grains of millet, etc.)

source: oburo butungmwire abaana batandike kubulinda enyonyi; akamweta kumutungurourra enkwanzi ze
en: Grains of mmet have began to form, children should start keeping watch of tbe birds. Tu nguurra, ku-, oku-, v.pr; She invitedberto unstringberbeads

source: tunguuta
en: To shake, wobble
